//
// EmotionModel.swift
//  MindPrep
//
//  Created by 어재선 on 7/12/25.
//

import Foundation

struct EmotionModel{
    let defaultEmotion: [String] = ["나쁜", "고마운", "괜찮은", "당황스러운", "궁금한", "놀라운", "따분한", "답답한", "불안한", "신기한"]
    let happinessEmotion: [String] = ["기쁜", "흐뭇한", "환호의", "자랑스러운", "후련한", "만족한", "평화로운", "느긋한", "유쾌한", "자유로운", "황홀한"]
    let sadEmotion: [String] = ["뭉클한", "서운한", "울적한", "울고싶은", "외로운", "애틋한", "무기력한", "침울한", "암담한", "안타까운", "허전한"]
    let angerEmotion: [String] = ["얄미운", "지겨운", "불쾌한", "짜증나는", "불행한", "언짢은", "기분나쁜", "불편한", "분한", "원망스러운", "괘씸한"]
    let aweEmotion: [String] = ["초조한", "무서운", "두려운", "긴장되는", "딱딱한", "난처한", "충격적인", "떨리는", "섬뜩한", "걱정스러운", "겁나는"]
    let etcEmotion: [String] = ["힘찬", "든든한", "당당한", "수줍은", "창피한", "이상한", "그저그런", "피곤한", "들뜬", "혼란스러운", "노곤한", "간절한", "감격스러운", "기대되는", "뿌듯한", "딱한"]
}
